profiling/shell_profiling/data_analyzer/bench.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8001

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      100
Time taken for tests:   6.859 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      3800000 bytes
Total body sent:        20600000
HTML transferred:       0 bytes
Requests per second:    14579.22 [#/sec] (mean)
Time per request:       6.859 [ms] (mean)
Time per request:       0.069 [ms] (mean, across all concurrent requests)
Transfer rate:          541.03 [Kbytes/sec] received
                        2932.93 kb/s sent
                        3473.95 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   0.6      3       7
Processing:     1    4   0.8      3      19
Waiting:        0    3   0.7      2      18
Total:          6    7   0.9      7      24
WARNING: The median and mean for the processing time are not within a normal deviation
        These results are probably not that reliable.
WARNING: The median and mean for the waiting time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      7
  75%      7
  80%      7
  90%      8
  95%      9
  98%      9
  99%     10
 100%     24 (longest request)